cdhooper/amigapci_stm32/fw/cubemx/Middlewares/ST/STM32_USB_Host_Library/Class/HID/Src/usbh_hid.c
  return status;
}

/**
  * @brief  USBH_HID_ClassRequest_ll
  *         The function is responsible for handling Standard requests
  *         for HID class.
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_HID_ClassRequest_ll(USBH_HandleTypeDef *phost, HID_HandleTypeDef *HID_Handle)
{
  USBH_StatusTypeDef status = USBH_BUSY;
  USBH_StatusTypeDef tstatus;

  /* Switch HID state machine */
  switch (HID_Handle->ctl_state)
  {
    case HID_REQ_INIT:
        HID_Handle->ctl_state = HID_REQ_GET_HID_DESC;
        break;
    case HID_REQ_GET_HID_DESC:
      /* Get HID Desc */
      tstatus = USBH_HID_GetHIDDescriptor(phost, HID_Handle->interface, USB_HID_DESC_SIZE);
      if (tstatus == USBH_OK) {
        USBH_HID_ParseHIDDesc(&HID_Handle->HID_Desc, phost->device.Data);
        HID_Handle->ctl_state = HID_REQ_GET_REPORT_DESC;

      } else if (tstatus != USBH_BUSY) {
        printf("USB%u.%u.%u failed get HID descriptor\n",
               get_port(phost), phost->address, HID_Handle->interface);
        HID_Handle->ctl_state = HID_REQ_GET_REPORT_DESC;
      }

      break;
    case HID_REQ_GET_REPORT_DESC:
      /* Get Report Desc */
      tstatus = USBH_HID_GetHIDReportDescriptor(phost, HID_Handle->interface, HID_Handle->HID_Desc.wItemLength);
      if (tstatus == USBH_OK) {
        /* The descriptor is available in phost->device.Data */
        USBH_HID_Process_HIDReportDescriptor(phost, HID_Handle);
        HID_Handle->ctl_state = HID_REQ_SET_IDLE;

      } else if (tstatus != USBH_BUSY) {
        printf("USB%u.%u.%u failed get HID report descriptor\n",
               get_port(phost), phost->address, HID_Handle->interface);
        HID_Handle->ctl_state = HID_REQ_SET_IDLE;
      }
      break;

    case HID_REQ_SET_IDLE:
      /* set Idle */
      tstatus = USBH_HID_SetIdle(phost, 0U, 0U);
      if ((tstatus == USBH_OK) || (tstatus == USBH_NOT_SUPPORTED)) {
        HID_Handle->ctl_state = HID_REQ_SET_PROTOCOL;

      } else if (tstatus != USBH_BUSY) {
        printf("USB%u.%u.%u failed setidle\n",
               get_port(phost), phost->address, HID_Handle->interface);
        HID_Handle->ctl_state = HID_REQ_SET_PROTOCOL;
      }
      break;

    case HID_REQ_SET_PROTOCOL:
      /* set report protocol */
      status = USBH_HID_SetProtocol(phost, 1U);
      if ((status == USBH_OK) || (status == USBH_NOT_SUPPORTED)) {
        HID_Handle->ctl_state = HID_REQ_IDLE;

        /* all requests performed */
        phost->pUser(phost, HOST_USER_CLASS_ACTIVE);
        status = USBH_OK;

      } else if ((status != USBH_BUSY)) {
        printf("USB%u.%u.%u failed setprotocol\n",
               get_port(phost), phost->address, HID_Handle->interface);
        HID_Handle->ctl_state = HID_REQ_IDLE;

        /* all requests performed */
        phost->pUser(phost, HOST_USER_CLASS_ACTIVE);
        status = USBH_OK;
      }
      break;

    case HID_REQ_IDLE:
    default:
      break;
  }

  return status;
}

/**
  * @brief  USBH_HID_ClassRequest
  *         The function is responsible for handling Standard requests
  *         for HID class.
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_HID_ClassRequest(USBH_HandleTypeDef *phost)
{
    uint bit = 0;
    USBH_StatusTypeDef status;
    HID_HandleTypeDef *HID_Handle = (HID_HandleTypeDef *) phost->pActiveClass->pData;

    /*
     * Serialize class requests because only one may be active
     * on the USB host at any time.
     */
    while (HID_Handle != NULL) {
        if (phost->iface_waiting) {
            if (phost->iface_waiting & BIT(bit)) {
                status = USBH_HID_ClassRequest_ll(phost, HID_Handle);
                if (status != USBH_BUSY)
                    phost->iface_waiting &= ~BIT(bit);
            }
        } else {
            status = USBH_HID_ClassRequest_ll(phost, HID_Handle);
            if (status == USBH_BUSY) {
                phost->iface_waiting |= BIT(bit);
                break;  // Check again later
            }
        }
        bit++;
        HID_Handle = HID_Handle->next;
    }
    return (phost->iface_waiting ? USBH_BUSY: USBH_OK);
}

static USBH_StatusTypeDef USBH_HID_Process_ll(USBH_HandleTypeDef *phost, HID_HandleTypeDef *HID_Handle)
{
  USBH_StatusTypeDef status = USBH_OK;
  uint32_t XferSize;

  switch (HID_Handle->state)
  {
    case HID_INIT:
      status = HID_Handle->Init(phost, HID_Handle);
      if (status != USBH_OK) {
        printf("USB%u.%u.%u HID init failure\n",
               get_port(phost), phost->address, HID_Handle->interface);
        HID_Handle->state = HID_ERROR;
        break;
      }
      HID_Handle->state = HID_VENDOR;

      uint8_t interface = HID_Handle->interface;
      uint max_ep = ((phost->device.CfgDesc.Itf_Desc[interface].bNumEndpoints <= USBH_MAX_NUM_ENDPOINTS) ?
             phost->device.CfgDesc.Itf_Desc[interface].bNumEndpoints : USBH_MAX_NUM_ENDPOINTS);

      for (uint num = 0U; num < max_ep; num++) {
        if (phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[num].bEndpointAddress & 0x80U) {
        /* Open pipe for IN endpoint */
          USBH_OpenPipe(phost, HID_Handle->InPipe, HID_Handle->InEp, phost->device.address,
                        phost->device.speed, USB_EP_TYPE_INTR, HID_Handle->length_max);
        } else {
        /* Open pipe for OUT endpoint */
          USBH_OpenPipe(phost, HID_Handle->OutPipe, HID_Handle->OutEp, phost->device.address,
                        phost->device.speed, USB_EP_TYPE_INTR, HID_Handle->length);
        }
      }

      USBH_LL_SetToggle(phost, HID_Handle->InPipe, 0U);

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_URB_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, NULL);
#endif
#endif
      break;

