cdhooper/amigapci_stm32/fw/cubemx/Middlewares/ST/STM32_USB_Host_Library/Class/HID/Src/usbh_hid.c
#if 0
/**
  * @brief  USBH_HID_GetPollInterval
  *         Return HID device poll time
  * @param  phost: Host handle
  * @retval poll time (ms)
  */
uint8_t USBH_HID_GetPollInterval(USBH_HandleTypeDef *phost)
{
  uint8_t interval = 0U;
  HID_HandleTypeDef *HID_Handle = (HID_HandleTypeDef *) phost->pActiveClass->pData;

  if ((phost->gState == HOST_CLASS_REQUEST) ||
      (phost->gState == HOST_INPUT) ||
      (phost->gState == HOST_SET_CONFIGURATION) ||
      (phost->gState == HOST_CHECK_CLASS) ||
      ((phost->gState == HOST_CLASS)))
  {
    while (HID_Handle != NULL) {
      if ((interval == 0) || (interval > HID_Handle->poll))
        interval = HID_Handle->poll;
      HID_Handle = HID_Handle->next;
    }
  }
  return (interval);
}
#endif
/**
  * @brief  USBH_HID_FifoInit
  *         Initialize FIFO.
  * @param  f: Fifo address
  * @param  buf: Fifo buffer
  * @param  size: Fifo Size
  * @retval none
  */
void USBH_HID_FifoInit(FIFO_TypeDef *f, uint8_t *buf, uint16_t size)
{
  f->head = 0U;
  f->tail = 0U;
  f->lock = 0U;
  f->size = size;
  f->buf = buf;
}

void USBH_HID_FifoFlush(FIFO_TypeDef *f)
{
  f->head = 0U;
  f->tail = 0U;
  f->lock = 0U;
}

/**
  * @brief  USBH_HID_FifoRead
  *         Read from FIFO.
  * @param  f: Fifo address
  * @param  buf: read buffer
  * @param  nbytes: number of item to read
  * @retval number of read items
  */
uint16_t USBH_HID_FifoRead(FIFO_TypeDef *f, void *buf, uint16_t nbytes)
{
  uint16_t i;
  uint8_t *p;

  p = (uint8_t *) buf;

  if (f->lock == 0U)
  {
    f->lock = 1U;

    for (i = 0U; i < nbytes; i++)
    {
      if (f->tail != f->head)
      {
        *p++ = f->buf[f->tail];
        f->tail++;

        if (f->tail == f->size)
        {
          f->tail = 0U;
        }
      }
      else
      {
        f->lock = 0U;
        return i;
      }
    }
  }

  f->lock = 0U;

  return nbytes;
}

/**
  * @brief  USBH_HID_FifoWrite
  *         Write To FIFO.
  * @param  f: Fifo address
  * @param  buf: read buffer
  * @param  nbytes: number of item to write
  * @retval number of written items
  */
uint16_t USBH_HID_FifoWrite(FIFO_TypeDef *f, void *buf, uint16_t  nbytes)
{
  uint16_t i;
  uint8_t *p;

  p = (uint8_t *) buf;

  if (f->lock == 0U)
  {
    f->lock = 1U;

    for (i = 0U; i < nbytes; i++)
    {
      if ((f->head + 1U == f->tail) ||
          ((f->head + 1U == f->size) && (f->tail == 0U)))
      {
        f->lock = 0U;
        return i;
      }
      else
      {
        f->buf[f->head] = *p++;
        f->head++;

        if (f->head == f->size)
        {
          f->head = 0U;
        }
      }
    }
  }

  f->lock = 0U;

  return nbytes;
}

/**
* @brief  The function is a callback about HID Data events
*  @param  phost: Selected device
* @retval None
*/
__weak void USBH_HID_EventCallback(USBH_HandleTypeDef *phost, HID_HandleTypeDef *HID_Handle)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(phost);
  UNUSED(HID_Handle);
}
/**
* @}
*/

/**
* @}
*/

/**
* @}
*/


/**
* @}
*/


/**
* @}
*/

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

#include "config.h"
#include "usbh_hid_mouse.h"

static int
readbits(void *ptr, uint startbit, uint bits, uint is_signed)
{
    uint byte = startbit / 8;
    uint bitoff = startbit % 8;
    uint mask = BIT(bits) - 1;
    uint val = ((*(uint *) ((uintptr_t) ptr + byte)) >> bitoff) & mask;

    if (is_signed &&
        (val & BIT(bits - 1))) {
        val |= (0 - BIT(bits));  // Sign-extend negative
    }

    return (val);
}

/*
 * readbits_joy() converts joystick values from the retronicdesign.com
 *                Atari C64 Amiga Joystick v3.2       ID e501.0810
 */
static int
readbits_joy(void *ptr, uint startbit, uint bits, int offset)
{
    int val = readbits(ptr, startbit, bits, 0) + offset;
    int range = abs(offset) / 4;
    if (val < 0 - range)
        val = -1;
    else if (val > 0 + range)
        val = 1;
    else
        val = 0;
#if 0
    switch (val) {
        case 0:             // 0x00
            val = -1;
            break;
        default:
        case  127:          // 0x7f
        case -128:          // 0x80
            val = 0;
            break;
        case -1:            // 0xff
            val = 1;
            break;
    }
#endif
    return (val);
}

static uint8_t
readbits_jpad(void *ptr, uint16_t *startbits)
{
    uint pos;
    uint jpad = 0;
    for (pos = 0; pos < 4; pos++)
        jpad |= ((!!readbits(ptr, startbits[pos], 1, 0)) << pos);
    return (jpad);
}


static uint32_t
readbits_buttons(void *ptr, HID_RDescTypeDef *rd)
{
    uint button;
    uint32_t buttons = 0;
    uint num_buttons = rd->num_buttons;

    if (num_buttons > ARRAY_SIZE(rd->pos_button))
        num_buttons = ARRAY_SIZE(rd->pos_button);

    for (button = 0; button < num_buttons; button++) {
        if ((button < ARRAY_SIZE(rd->pos_button)) &&
            readbits(ptr, rd->pos_button[button], 1, 0)) {
            buttons |= BIT(button);
        }
    }
    return (buttons);
}

/**
  * @brief  USBH_HID_DecodeReport
  *         The function gets and decodes mouse and generic data.
  * @param  phost: Host handle
  * @retval USBH Status
  */
USBH_StatusTypeDef
USBH_HID_DecodeReport(USBH_HandleTypeDef *phost, HID_HandleTypeDef *HID_Handle, HID_TypeTypeDef devtype, HID_MISC_Info_TypeDef *report_info)
{
    HID_RDescTypeDef *rd = &HID_Handle->HID_RDesc;
    uint32_t          report_data[4];
    static uint32_t   report_last[ARRAY_SIZE(report_data)];
    uint16_t          len = sizeof (report_data);
    uint button;
    uint rlen;

    if (HID_Handle == NULL)
        return USBH_FAIL;

    if (HID_Handle->length == 0U)
        return USBH_FAIL;

    if (len > HID_Handle->length)
        len = HID_Handle->length;
    memset(&report_data, 0, sizeof (report_data));
    rlen = USBH_HID_FifoRead(&HID_Handle->fifo, &report_data, len);
    USBH_HID_FifoFlush(&HID_Handle->fifo);  // Discard excess data

    /* Fill report */
    if (rlen > 0) {
        uint cur;
        uint8_t id = report_data[0];
        memset(report_info, 0, sizeof (*report_info));
        report_info->usage = rd->usage;

        if (((rd->id_mouse != 0) && (rd->id_mouse == id)) ||
            ((rd->id_mouse == 0) && (devtype == HID_MOUSE))) {
is_mouse:
            dprintf(DF_USB_DECODE_MOUSE, "\n%08lx %08lx ",
                    report_data[0], report_data[1]);

