cdhooper/amigapci_stm32/fw/cubemx/Middlewares/ST/STM32_USB_Host_Library/Class/HID/Src/usbh_hid.c
            report_info->buttons = readbits_buttons(report_data, rd);
            report_info->x = readbits(report_data, rd->pos_x, rd->bits_x, 1);
            report_info->y = readbits(report_data, rd->pos_y, rd->bits_y, 1);
            if (rd->bits_wheel != 0) {
                report_info->wheel = readbits(report_data, rd->pos_wheel,
                                              rd->bits_wheel, 1);
            }
            if (rd->bits_ac_pan != 0) {
                report_info->ac_pan = readbits(report_data, rd->pos_ac_pan,
                                               rd->bits_ac_pan, 1);
            }
        } else if ((rd->id_consumer != 0) && (rd->id_consumer == id)) {
            dprintf(DF_USB_DECODE_MISC, "mmkey");
            for (cur = 0; cur < rd->num_keys; cur++) {
                if (rd->pos_key[cur] == 0)
                    continue;
                report_info->mm_key[cur] =
                        readbits(report_data, rd->pos_key[cur], rd->bits_key, 1);
                dprintf(DF_USB_DECODE_MISC, " %x", report_info->mm_key[cur]);
            }
        } else if ((rd->id_sysctl != 0) && (rd->id_sysctl == id)) {
            report_info->sysctl = readbits(report_data,
                                           rd->pos_sysctl, rd->bits_sysctl, 1);
            dprintf(DF_USB_DECODE_MISC, "Sysctl %x", report_info->sysctl);
        } else if ((rd->id_mouse == 0) && (rd->usage == HID_USAGE_MOUSE)) {
            goto is_mouse;
        } else if ((rd->usage == HID_USAGE_JOYSTICK) ||
                   (rd->usage == HID_USAGE_GAMEPAD)) {
            report_info->buttons = readbits_buttons(report_data, rd);
            report_info->x = readbits_joy(report_data, rd->pos_x,
                                          rd->bits_x, rd->offset_xy);
            report_info->y = readbits_joy(report_data, rd->pos_y,
                                          rd->bits_y, rd->offset_xy);
            if (rd->pos_jpad[0] != 0) {
                report_info->flags |= MI_FLAG_HAS_JPAD;  // Has joypad
                report_info->jpad = readbits_jpad(report_data,
                                                  rd->pos_jpad);
            }
            if (rd->bits_ac_pan != 0) {
                report_info->ac_pan = readbits_joy(report_data,
                                                   rd->pos_ac_pan,
                                                   rd->bits_ac_pan,
                                                   rd->offset_xy);
            }
            if (rd->bits_wheel != 0) {
                report_info->wheel = readbits_joy(report_data,
                                                  rd->pos_wheel,
                                                  rd->bits_wheel,
                                                  rd->offset_xy);
            }
            if (config.debug_flag & DF_USB_DECODE_JOY) {
                if (rd->pos_jpad[0] &&
                    (phost->device.DevDesc.idVendor == 0x057e) &&
                    (phost->device.DevDesc.idProduct == 0x2009)) {
                    /* EasySMX PC USB controller adds timestamp to report */
                    report_data[0] &= ~0x00ff00;  // Clobber timestamp
                }
                if (memcmp(report_data, report_last, 12) != 0) {
                    memcpy(report_last, report_data, sizeof (report_last));
                    printf("\n%08lx %08lx %08lx",
                           report_data[0], report_data[1], report_data[2]);
                    printf(" [%d %d %d %d] ", report_info->x, report_info->y,
                           report_info->ac_pan, report_info->wheel);
                }
            }
        } else {
            if ((config.debug_flag & DF_USB_DECODE_JOY) &&
                (memcmp(report_data, report_last, sizeof (report_data)) != 0)) {
                printf("\n%08lx %08lx %08lx %08lx",
                       report_data[0], report_data[1], report_data[2],
                       report_data[3]);
                memcpy(report_last, report_data, sizeof (report_last));
            }
//          dprintf(DF_USB_DECODE_MISC, "Misc ID %x", id);
        }
        cur = 0;
        for (button = 0; button < rd->num_mmbuttons; button++) {
            uint val;
            if (id != rd->id_mmbutton[button])
                continue;
            val = readbits(report_data, rd->pos_mmbutton[button], 1, 0);
            if (val != 0) {
                if (cur == 0)
                    dprintf(DF_USB_DECODE_MISC, "MMKEY");
                dprintf(DF_USB_DECODE_MISC, " %x", rd->val_mmbutton[button]);
                report_info->mm_key[cur++] = rd->val_mmbutton[button];
                if (cur == ARRAY_SIZE(report_info->mm_key))
                    break;
            }
        }
        return USBH_OK;
    }
    return   USBH_FAIL;
}

static uint32_t hid_rx_report_buf[2][HID_QUEUE_SIZE * 4];

void
USBH_HID_PrepareFifo(USBH_HandleTypeDef *phost, HID_HandleTypeDef *HID_Handle)
{
    uint port = phost->id;

    if (HID_Handle->length_max > sizeof (hid_rx_report_buf[port]))
        HID_Handle->length_max = sizeof (hid_rx_report_buf[port]);

    memset(hid_rx_report_buf[port], 0, sizeof (hid_rx_report_buf[port]));

    HID_Handle->pData = (uint8_t *)(void *) hid_rx_report_buf[port];
    USBH_HID_FifoInit(&HID_Handle->fifo, phost->device.Data,
                      sizeof (hid_rx_report_buf[port]));
}
